load_testing_directory/results/total_requests_increment_results.txt
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      100
Time taken for tests:   6.919 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      32706000 bytes
HTML transferred:       32370000 bytes
Requests per second:    289.08 [#/sec] (mean)
Time per request:       345.925 [ms] (mean)
Time per request:       3.459 [ms] (mean, across all concurrent requests)
Transfer rate:          4616.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    17  341  49.4    347     500
Waiting:        3  323  49.1    329     479
Total:         19  341  49.4    347     500

Percentage of the requests served within a certain time (ms)
  50%    347
  66%    361
  75%    368
  80%    375
  90%    391
  95%    406
  98%    421
  99%    440
 100%    500 (longest request)

 ---

Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      100
Time taken for tests:   16.929 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      81765000 bytes
HTML transferred:       80925000 bytes
Requests per second:    295.36 [#/sec] (mean)
Time per request:       338.573 [ms] (mean)
Time per request:       3.386 [ms] (mean, across all concurrent requests)
Transfer rate:          4716.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    14  337  42.0    342     457
Waiting:        2  318  41.7    324     433
Total:         15  337  42.0    342     458

Percentage of the requests served within a certain time (ms)
  50%    342
  66%    354
  75%    361
  80%    365
  90%    378
  95%    389
  98%    402
  99%    410
 100%    458 (longest request)

 ---

 Completed 2000 requests
Completed 4000 requests
Completed 6000 requests
Completed 8000 requests
Completed 10000 requests
Completed 12000 requests
Completed 14000 requests
Completed 16000 requests
Completed 18000 requests
Completed 20000 requests
Finished 20000 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      100
Time taken for tests:   68.045 seconds
Complete requests:      20000
Failed requests:        0
Total transferred:      327060000 bytes
HTML transferred:       323700000 bytes
Requests per second:    293.92 [#/sec] (mean)
Time per request:       340.223 [ms] (mean)
Time per request:       3.402 [ms] (mean, across all concurrent requests)
Transfer rate:          4693.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    16  340  40.6    344     480
Waiting:        2  321  40.3    325     454
Total:         16  340  40.6    344     480

Percentage of the requests served within a certain time (ms)
  50%    344
  66%    356
  75%    363
  80%    368
  90%    381
  95%    392
  98%    405
  99%    416
 100%    480 (longest request)

 ---

Completed 3000 requests
Completed 6000 requests
Completed 9000 requests
Completed 12000 requests
Completed 15000 requests
Completed 18000 requests
Completed 21000 requests
Completed 24000 requests
Completed 27000 requests
Completed 30000 requests
Finished 30000 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      100
Time taken for tests:   102.611 seconds
Complete requests:      30000
Failed requests:        0
Total transferred:      490590000 bytes
HTML transferred:       485550000 bytes
Requests per second:    292.37 [#/sec] (mean)
Time per request:       342.036 [ms] (mean)
Time per request:       3.420 [ms] (mean, across all concurrent requests)
Transfer rate:          4669.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:    17  342  41.6    346     486
Waiting:        3  323  41.3    327     475
Total:         17  342  41.6    346     487

Percentage of the requests served within a certain time (ms)
  50%    346
  66%    358
  75%    365
  80%    370
  90%    384
  95%    396
  98%    411
  99%    421
 100%    487 (longest request)

 ---

 Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Completed 35000 requests
Completed 40000 requests
Completed 45000 requests
Completed 50000 requests
Finished 50000 requests


Server Software:        Werkzeug/3.1.3
Server Hostname:        127.0.0.1
Server Port:            5000

Document Path:          /items
Document Length:        16185 bytes

Concurrency Level:      100
Time taken for tests:   175.227 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      817650000 bytes
HTML transferred:       809250000 bytes
Requests per second:    285.34 [#/sec] (mean)
Time per request:       350.453 [ms] (mean)
Time per request:       3.505 [ms] (mean, across all concurrent requests)
Transfer rate:          4556.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       4
Processing:    16  350  43.6    353     555
Waiting:        2  331  43.3    334     527
Total:         17  350  43.6    353     555

Percentage of the requests served within a certain time (ms)
  50%    353
  66%    366
  75%    374
  80%    380
  90%    395
  95%    409
  98%    428
  99%    443
 100%    555 (longest request)